# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger

import my_burger

my_burger.adding_bun()
my_burger.adding_cutlet()
my_burger.adding_cheese()
my_burger.adding_cutlet()
my_burger.adding_cheese()
my_burger.adding_cucumber()
my_burger.adding_tomato()
my_burger.adding_mayo()
my_burger.adding_bun()

print('Создадим сейчас свой бургер! И... ')
my_burger.adding_bun()
my_burger.adding_mayo()
my_burger.adding_catchup()
my_burger.adding_cutlet()
my_burger.adding_cheese()
my_burger.adding_cutlet()
my_burger.adding_cheese()
my_burger.adding_jalapenos()
my_burger.adding_cutlet()
my_burger.adding_cheese()
my_burger.adding_cucumber()
my_burger.adding_tomato()
my_burger.adding_bun()

#  задача требует 2 рецепта:
#   рецепт двойного чизбургера (строка 12);
#   рецепт своего бургера, по вашему вкусу (строка 15).

# зачет!